package student_alexander_shl.homework.lesson_2.level_x.super_task_5;

/* Пример многострочного комментария:

Напишите программу и продемонстрируйте в ней использование
однострочного и многострочного коментариев.
 */

import teacher.annotations.CodeReview;

@CodeReview(approved = true)
class Super_task_5 {
    public static void main(String[] args) {
        System.out.print("Hello World!"); // Вывод на консоль: Пример однострочного комментария
    }
}
