package student_alexander_shl.homework.lesson_3.level_1.task_1;
/*
Создайте класс робот (Robot).

Научите вашего робота "говорить" привет.

Создайте в классе Robot метод со следующей сигнатурой:

    public void sayHello() {
        // тут напишите команду распечатки на консоли строки "Hello!"
    }
 */

class Robot {
     public void sayHello() {
        System.out.println("Hello!");

    }
}
