package student_alexander_shl.homework.lesson_2.level_5;

import teacher.annotations.CodeReview;

/*
Команда System.out.println("text"); выводит указанный "text"
на консоль, и переводит курсор на новую строку.

Для того, что бы выводить текст на консоль без перевода курсора на
новую строку можно воспользоваться командой
    System.out.print("text");
эта команда распечатает текст на консоль и оставит курсор в той же строке.

Напишите программу, которая демонстрирует использование команды
    System.out.print("text");
 */
@CodeReview(approved = true)
class Task_15 {
    public static void main(String[] args) {
        System.out.print("Ku");
        System.out.print("-");
        System.out.print("Ku");
        System.out.print("!");
        System.out.print(" :))))");
    }
}
