package student_regina_svistunov.lesson_8.level_3;

//Что такое абстрактный класс?
//        Можно ли создать экземпляр абстрактного класса
//        в момент выполнения программы?

import teacher.annotations.CodeReview;

@CodeReview(approved = true)
public class Task_10 {
}

// Абстрактный класс это грубо говоря заготовка(чертеж) для классов,
// те абстрактная схема будующего (нормального) класса.
// Абстракция говорить что обьек делает, а не как делает. А как делать можно уже потом определить.




