package student_regina_svistunov.lesson_8.level_2;

public class Task_5 {
}

//    Что такое множественное наследование
//    в программировании?
//        Разрешено ли множественное наследование в Java?


//Ответ:
//    Множественное наследование дает возможность создать класс,
////    наследованный от нескольких суперклассов.
//в Java запрещено множественное наследование от классов.
//        Java не поддерживает множественное наследование классов потому,
//        что это может привести к ромбовидной проблеме.
//    множественное наследование не поддерживается в классах,
//    но оно поддерживается в интерфейсах.

