package student_pjotrs_grezmanis.lesson_3.level_2;

 class Task_10 {

    /*

- Где ханитятся обьекты класса String?
Обьекты класса String хранятся в String Pool.

- Как определить длину строки?
Чтобы узнать длину строки
воспользуемся методом length класса String.

- Как сравнивать две строки?
Сравнить две строки можно с помощью equals()
или оператора ==.

- Что такое String Pool и зачем он нужен?
Это множество строк в одной ссылке памяти (heap),
 где уже сохранены рание созданные объекты.
 String Poll значительно позволяет экономить память.
     */
}
